In [3]:
import numpy as np
import pandas as pd
from numpy.random import randn
from numpy import NaN
from numpy.linalg import inv,qr, eig ,det ,svd

import matplotlib.pyplot as plt
import random

from pandas import DataFrame , Series

In [4]:
df1 = DataFrame({'d':[NaN,NaN,NaN,NaN],'s':[1,2,35,335]})

In [5]:
df1

    d    s
0 NaN    1
1 NaN    2
2 NaN   35
3 NaN  335

In [6]:
df2 = DataFrame({'d':[NaN,NaN,NaN,NaN],'s':[11,22,345,33335]})

## 左边的一个nulljoin右边多个null，产生笛卡尔积

* 两张表的某一列完全是NaN的情况，不管什么how执行merge都是产生笛卡尔积（认为一个NaN等于另一张表中的全部NaN）

In [9]:
df1.merge(df2,on='d',how ='inner') #笛卡尔积

     d  s_x    s_y
0  NaN    1     11
1  NaN    1     22
2  NaN    1    345
3  NaN    1  33335
4  NaN    2     11
5  NaN    2     22
6  NaN    2    345
7  NaN    2  33335
8  NaN   35     11
9  NaN   35     22
10 NaN   35    345
11 NaN   35  33335
12 NaN  335     11
13 NaN  335     22
14 NaN  335    345
15 NaN  335  33335

In [12]:
df1.merge(df2,on='d',how ='outer') #笛卡尔积

     d  s_x    s_y
0  NaN    1     11
1  NaN    1     22
2  NaN    1    345
3  NaN    1  33335
4  NaN    2     11
5  NaN    2     22
6  NaN    2    345
7  NaN    2  33335
8  NaN   35     11
9  NaN   35     22
10 NaN   35    345
11 NaN   35  33335
12 NaN  335     11
13 NaN  335     22
14 NaN  335    345
15 NaN  335  33335

In [14]:
df1.merge(df2,on='d',how ='left') #笛卡尔积

     d  s_x    s_y
0  NaN    1     11
1  NaN    1     22
2  NaN    1    345
3  NaN    1  33335
4  NaN    2     11
5  NaN    2     22
6  NaN    2    345
7  NaN    2  33335
8  NaN   35     11
9  NaN   35     22
10 NaN   35    345
11 NaN   35  33335
12 NaN  335     11
13 NaN  335     22
14 NaN  335    345
15 NaN  335  33335

In [10]:
df1.merge(df2,on='s',how ='inner') #没有

Empty DataFrame
Columns: [d_x, s, d_y]
Index: []

In [11]:
df3 = DataFrame({'d':[1,NaN,3,NaN],'s':[1,2,35,335]})
df4 = DataFrame({'d':[1,2,NaN,NaN],'s':[1,2,35,335]})

In [19]:
df3.merge(df4,how = 'inner',on ='d')

     d  s_x  s_y
0  1.0    1    1
1  NaN    2   35
2  NaN    2  335
3  NaN  335   35
4  NaN  335  335

In [20]:
df3

     d    s
0  1.0    1
1  NaN    2
2  3.0   35
3  NaN  335

In [21]:
df4

     d    s
0  1.0    1
1  2.0    2
2  NaN   35
3  NaN  335

In [22]:
NaN ==NaN

False

## 检查普通的拥有重复on字段的表的join行为

In [23]:
df5 = DataFrame({'d':[1,2,3,2],'s':[1,2,35,335]})
df6 = DataFrame({'d':[1,2,2,45],'s':[1,2,35,335]})

In [26]:
df5.merge(df6,how = 'inner',on ='d')

   d  s_x  s_y
0  1    1    1
1  2    2    2
2  2    2   35
3  2  335    2
4  2  335   35

In [27]:
df7 = DataFrame({'d1':[1,2,3,2],'s':[1,2,35,335]})
df8 = DataFrame({'d2':[1,2,2,45],'s':[1,2,35,335]})

In [28]:
df7

   d1    s
0   1    1
1   2    2
2   3   35
3   2  335

In [29]:

df8

   d2    s
0   1    1
1   2    2
2   2   35
3  45  335

In [32]:
df7.merge(df8,how = 'inner',left_on ='d1',right_on = 'd2')

   d1  s_x  d2  s_y
0   1    1   1    1
1   2    2   2    2
2   2    2   2   35
3   2  335   2    2
4   2  335   2   35